kafka_benchmark_results_20250924_211445/low-latency/producer-test.log
5000 records sent, 1000.0 records/sec (0.98 MB/sec), 10.1 ms avg latency, 313.0 ms max latency.
5000 records sent, 1000.0 records/sec (0.98 MB/sec), 1.1 ms avg latency, 6.0 ms max latency.
12000 records sent, 999.333777 records/sec (0.98 MB/sec), 4.86 ms avg latency, 313.00 ms max latency, 1 ms 50th, 3 ms 95th, 126 ms 99th, 148 ms 99.9th.